3-ror/image-assertion/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @photos = @user.photos.build
    respond_to do |format|
      if @user.save
---
INSERT INTO "photos" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 1], ["created_at", "2020-06-05 19:34:10.051056"], ["updated_at", "2020-06-05 19:34:10.051056"]]
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "asd"], ["created_at", "2020-06-05 19:34:10.033795"], ["updated_at", "2020-06-05 19:34:10.033795"]]