3-ror/image-assertion/app/views/users/_form.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = ? ORDER BY "photos"."id" ASC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
  <p>
    <% if user.photos.first.image.exists? %>
    <%  @user.photos.each do |record|%>