3-ror/image-assertion/app/views/users/show.html.erb


<p><%= image_tag @user.photos.first.image.url %></p>
---
SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = ? ORDER BY "photos"."id" ASC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]